{
  "access control": "Mechanisms that enforce access rights to resources.",
  "active attack": "An attack that attempts to alter system resources or affect their operation.",
  "asymmetric encryption algorithms": "Encryption algorithms that use two related keys: a public key and a private key.",
  "attack": "Any action that compromises the security of information.",
  "authentication": "A process used to verify the identity of a user, process, or system.",
  "authentication exchange": "A mechanism to ensure the identity of an entity through information exchange.",
  "authenticity": "The property that ensures the entity is who it claims to be.",
  "availability": "Ensures that systems work promptly and service is not denied to authorized users.",
  "block cipher": "A symmetric encryption algorithm that operates on fixed-size blocks of data.",
  "confidentiality": "Preserving authorized restrictions on information access and disclosure.",
  "cryptographic hash function": "A function that turns variable text into a fixed-length value, useful in cryptographic algorithms.",
  "cryptography": "A branch of mathematics dealing with the transformation of data for secure storage and transmission.",
  "cybersecurity": "The practice of protecting systems, networks, and programs from digital attacks and unauthorized access.",
  "data authenticity": "Ensures the integrity and origin of data through verification.",
  "data confidentiality": "Ensures that data is not disclosed to unauthorized parties.",
  "data integrity": "Ensures that data remains accurate, consistent, and unaltered during processing and storage.",
  "data origin authentication": "Ensures that the claimed source of information is authentic.",
  "denial of service": "An attack that makes a system or network unavailable to users.",
  "digital signature algorithms": "Algorithms used to generate and verify digital signatures for data integrity and origin authentication.",
  "eavesdropping": "Unauthorized interception of information.",
  "encryption": "The process of converting plaintext into ciphertext to protect information during transmission or storage.",
  "firewall": "A hardware or software capability that limits access between a network and devices based on security policy.",
  "information security": "The practice of protecting information from unauthorized access, disclosure, alteration, or destruction.",
  "intrusion detection": "A mechanism that gathers and analyzes information to detect attempts to access systems in an unauthorized manner.",
  "intrusion prevention": "A mechanism designed to detect and stop intrusive activities.",
  "key exchange": "The process of securely distributing a symmetric key to multiple parties.",
  "keyless algorithm": "Deterministic functions used in cryptography that do not involve keys.",
  "man-in-the-middle attack": "An attack where an adversary intercepts and potentially alters communication between two parties.",
  "masquerade": "An attack where an entity pretends to be a different authorized entity.",
  "message authentication code": "A cryptographic transformation involving a secret key and a hash function to verify the integrity of a message.",
  "network security": "Encompasses the security of communication pathways, network devices, and attached devices.",
  "notarization": "The use of a trusted third party to confirm certain properties of a data exchange.",
  "OSI security architecture": "Security architecture defined by the Open Systems Interconnection model.",
  "passive attack": "An attack that attempts to gain unauthorized access or information without altering system resources.",
  "peer entity authentication": "The process of confirming the identity of a communicating peer.",
  "privacy": "The protection of personal information from unauthorized access and disclosure.",
  "pseudorandom number generator": "Produces a deterministic sequence that appears random, commonly used in cryptographic applications.",
  "replay": "An attack that involves the replay of previously captured data.",
  "routing control": "Enables the selection of secure routes for data and allows changes during security breaches.",
  "security attack": "Any action that compromises the security of information.",
  "security mechanism": "A process or device designed to implement a security service.",
  "security service": "A processing or communication service provided by a security mechanism.",
  "single-key algorithm": "Encryption algorithms that use a single, shared key for both encryption and decryption.",
  "stream cipher": "A symmetric encryption algorithm that operates on individual bits rather than blocks of data.",
  "symmetric encryption algorithms": "Encryption algorithms that use a single shared key for both encryption and decryption.",
  "system integrity": "Ensures that a system is not altered by unauthorized users.",
  "threat": "Any potential danger to information systems.",
  "trust": "Confidence that an entity will perform as expected without causing harm to the system user.",
  "trust relationship": "A relationship based on trust between two entities.",
  "trustworthiness": "The degree to which an entity is deserving of trust.",
  "two-key algorithm": "Asymmetric encryption algorithms that use two related keys: a public key and a private key.",
  "user authentication": "The process of confirming the identity of a user."
}